In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
from numpy.random import randn

In [10]:

ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [11]:
ser

1  a   -0.286493
   b    0.366774
   c   -0.445303
2  a    0.738227
   b    0.701238
   c   -0.589552
dtype: float64

In [12]:
ser[1].a

-0.28649296105894145

In [13]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [14]:
ser[1]

a   -0.286493
b    0.366774
c   -0.445303
dtype: float64

In [15]:
ser[2]

a    0.738227
b    0.701238
c   -0.589552
dtype: float64

In [32]:
ser[:,'a']

1   -0.286493
2    0.738227
dtype: float64

In [23]:
dframe = ser.unstack()

In [24]:
dframe

          a         b         c
1 -0.286493  0.366774 -0.445303
2  0.738227  0.701238 -0.589552

In [29]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],columns=[['NY','NY','LA','SA'],['cold','hot','cold','hot']])

In [30]:
dframe2

      NY       LA  SA
    cold hot cold hot
a 1    0   1    2   3
  2    4   5    6   7
b 1    8   9   10  11
  2   12  13   14  15

In [35]:
dframe2.iloc(1)

In [36]:
dframe2.index.names = ['index_1','index_2']

In [37]:
dframe2

                  NY       LA  SA
                cold hot cold hot
index_1 index_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [38]:
dframe2.columns.names = ['Cities','Temp']

In [39]:
dframe2

Cities            NY       LA  SA
Temp            cold hot cold hot
index_1 index_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [41]:
t = Series([0,1,2,3],index=['a','b','c','d'])

In [42]:
t

a    0
b    1
c    2
d    3
dtype: int64

In [43]:
t.index.name = 'hello'

In [44]:
t

hello
a    0
b    1
c    2
d    3
dtype: int64

In [47]:
t.name = 'values'

In [48]:
t

hello
a    0
b    1
c    2
d    3
Name: values, dtype: int64

In [64]:
# swaplevel will swap the levels of temp and cities rows and we need to specify the axis
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot cold hot
Cities            NY  NY   LA  SA
index_1 index_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [65]:
dframe2

Cities            NY       LA  SA
Temp            cold hot cold hot
index_1 index_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [67]:
dframe2.sum(level='Cities',axis=1)

Cities           NY  LA  SA
index_1 index_2
a       1         1   2   3
        2         9   6   7
b       1        17  10  11
        2        25  14  15

In [70]:
dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
index_1 index_2
a       1           2    4
        2          10   12
b       1          18   20
        2          26   28